МультиПорт/src/ExchangePlans/MultiPort_ВнешниеСистемы/MultiPort_ВнешниеСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="e45e4e2b-55db-4f62-9359-d2c07c243bd7">
  <name>MultiPort_ВнешниеСистемы</name>
  <attributes>
    <name>ОбменВключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСоединения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыПодключения</name>
    <type>
      <types>CatalogRef.MultiPort_ПодключенияКВнешнимСистемам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСведения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяРеглЗаданий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДРеглЗаданияПодготовкаИсходящих</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДРеглЗаданияОтправкаИсходящих</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДРеглЗаданияОбработкаВходящих</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДРеглЗаданияУдалениеСообщений</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияСообщенийВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбрабатываемыхИсходящихБезОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбрабатываемыхИсходящихСОшибками</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыгружаемыхИсходящихБезОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыгружаемыхИсходящихСОшибками</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбрабатываемыхВходящихБезОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбрабатываемыхВходящихСОшибками</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУдаляемыхСообщений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:ExchangePlan>

МультиПорт/src/ExchangePlans/MultiPort_ВнешниеСистемы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
		
	Если ПометкаУдаления Тогда
		ОбменВключен = Ложь;
	КонецЕсли;
	
	Если КоличествоУдаляемыхСообщений = 0 Тогда
		КоличествоУдаляемыхСообщений = 1;
	КонецЕсли;
	
	МетаданныеРеглЗадания = Метаданные.РегламентныеЗадания.MultiPort_ПодготовкаИсходящих;	
	ПодготовитьРеглЗадания(ИДРеглЗаданияПодготовкаИсходящих, МетаданныеРеглЗадания,
							"Подготовка исходящих", "РасписаниеПодготовкаИсходящихНовое");
	
	МетаданныеРеглЗадания = Метаданные.РегламентныеЗадания.MultiPort_ОтправкаИсходящих;	
	ПодготовитьРеглЗадания(ИДРеглЗаданияОтправкаИсходящих, МетаданныеРеглЗадания,
							"Отправка исходящих", "РасписаниеОтправкаИсходящихНовое");
	
	Если Не ЭтотУзел Тогда
		МетаданныеРеглЗадания = Метаданные.РегламентныеЗадания.MultiPort_ОбработкаВходящих;	
		ПодготовитьРеглЗадания(ИДРеглЗаданияОбработкаВходящих, МетаданныеРеглЗадания,
							"Обработка входящих", "РасписаниеОбработкаВходящихНовое");
		
		МетаданныеРеглЗадания = Метаданные.РегламентныеЗадания.MultiPort_УдалениеНеактуальныхДанных;	
		ПодготовитьРеглЗадания(ИДРеглЗаданияУдалениеСообщений, МетаданныеРеглЗадания,
							"Удаление сообщений", "РасписаниеУдалениеНеактуальныхСообщенийНовое");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры	

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбменВключен Тогда
		ВключитьРеглЗадание(ИДРеглЗаданияПодготовкаИсходящих, "РасписаниеПодготовкаИсходящихВключено");
		ВключитьРеглЗадание(ИДРеглЗаданияОтправкаИсходящих, "РасписаниеОтправкаИсходящихВключено");
		Если Не ЭтотУзел Тогда
			ВключитьРеглЗадание(ИДРеглЗаданияОбработкаВходящих, "РасписаниеОбработкаВходящихВключено");
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЭтотУзел Тогда
		ВключитьРеглЗадание(ИДРеглЗаданияУдалениеСообщений, "РасписаниеУдалениеНеактуальныхСообщенийВключено");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьРеглЗадания(ИДРеглЗадания, МетаданныеРеглЗадания, ИмяДействияРеглЗадания, ИмяНовогоРасписания)
	
	Если ОбменВключен И ДополнительныеСвойства.Свойство(ИмяНовогоРасписания) Тогда		
		
		Если Не ЗначениеЗаполнено(ИДРеглЗадания) Тогда
			РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданныеРеглЗадания);
		Иначе
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИДРеглЗадания);
			Если РегламентноеЗадание = Неопределено Тогда
				РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданныеРеглЗадания);
			КонецЕсли;
		КонецЕсли;
		РегламентноеЗадание.Наименование = СтрШаблон("(MultiPort) Внешняя система %1 %2", Код, ИмяДействияРеглЗадания);
		РегламентноеЗадание.ИмяПользователя = ИмяПользователяРеглЗаданий;
		РегламентноеЗадание.Использование = Ложь;
		РегламентноеЗадание.Записать();
		ИДРеглЗадания = РегламентноеЗадание.УникальныйИдентификатор;
		
	Иначе
		Если ЗначениеЗаполнено(ИДРеглЗадания) Тогда
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИДРеглЗадания);
			Если РегламентноеЗадание <> Неопределено Тогда
				РегламентноеЗадание.Использование = Ложь;
				РегламентноеЗадание.Записать();				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство(ИмяНовогоРасписания) И ЗначениеЗаполнено(ИДРеглЗадания) Тогда
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИДРеглЗадания);
		Если РегламентноеЗадание <> Неопределено Тогда
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ДополнительныеСвойства[ИмяНовогоРасписания]);
			Расписание = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON, Тип("РасписаниеРегламентногоЗадания"));
			РегламентноеЗадание.Расписание = Расписание;
			РегламентноеЗадание.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

Процедура ВключитьРеглЗадание(ИДРеглЗадания, ИмяРеквизитаРасписаниеВключено)
	
	Если Не ДополнительныеСвойства.Свойство(ИмяРеквизитаРасписаниеВключено) Тогда
		РасписаниеВключено = Ложь;
	Иначе
		РасписаниеВключено = ДополнительныеСвойства[ИмяРеквизитаРасписаниеВключено];
	КонецЕсли;
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИДРеглЗадания);
	Если РегламентноеЗадание <> Неопределено Тогда
		
		РасписаниеВключено = ДополнительныеСвойства[ИмяРеквизитаРасписаниеВключено];
		РегламентноеЗадание.Использование = РасписаниеВключено;
		РегламентноеЗадание.Параметры.Очистить();
		РегламентноеЗадание.Параметры.Добавить(Ссылка);
		РегламентноеЗадание.Параметры.Добавить(ИДРеглЗадания);
		РегламентноеЗадание.Записать();
	КонецЕсли;
		
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
